<template>
  <div class="protocol-wrap">
    <div class="title">用户协议</div>
    <div class="tip">
      <span>更新日期：【2024】年【10】月【8】日</span>
      <span>生效日期：【2024】年【10】月【8】日 </span>
    </div>
    <div class="detail" v-for="item of list" :key="item.label">
      <div class="label">{{ item.label }}</div>
      <div class="text" v-for="(el, index) of item.words" :key="index">{{ el }}</div>
    </div>
  </div>
</template>

<script setup lang="ts">
const list = [
  {
    label: '一、协议概述',
    words: [
      '  为使用[公司全称]提供的舆情研判平台（以下简称“本系统”），您应当阅读并遵守本《舆情研判服务协议》（以下简称“本协议”）。请您务必仔细阅读、充分理解各条款内容，特别是免除或限制责任的相应条款，以及开通或使用某项服务的单独协议，并选择接受或不接受。除非您已阅读并接受本协议所有条款，否则您无权使用本系统。您对本系统的登录、查看、发布信息等行为即视为您已阅读并同意本协议的约束。',
    ],
  },
  {
    label: '二、服务内容',
    words: [
      '1、舆情监测：甲方为乙方提供全面的舆情监测服务，包括但不限于网络新闻、论坛、博客、微博等社交媒体平台的舆情信息收集。',
      '2、舆情分析：甲方对收集到的舆情信息进行深入分析，包括但不限于舆情趋势分析、情感分析、关键词分析等。',
      '3、舆情报告：甲方为乙方提供事件的舆情报告，帮助乙方了解舆情动态和趋势。',
      '4、其他服务：根据乙方的具体需求，甲方可提供其他定制化的舆情研判服务。',
    ],
  },
  {
    label: '三、用户行为规范',
    words: [
      '1、乙方不得利用本系统制作、复制、发布、传播含有违反宪法、损害国家荣誉和利益、煽动民族仇恨、破坏民族团结、散布谣言、扰乱社会秩序、散布淫秽色情等内容的信息。',
      '2、乙方不得发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容',
      '3、乙方不得提交、发布虚假信息，或冒充、利用他人名义进行活动。',
      '4、乙方在使用本系统时，应遵守法律法规、政策及公序良俗，不得干扰平台正常运营和侵犯其他用户或第三方合法权益。',
    ],
  },
  {
    label: '四、协议变更与终止',
    words: [
      '1、甲方有权在必要时修改本协议条款。本协议条款变更后，如果乙方继续使用本系统，即视为乙方已接受修改后的协议。如乙方不接受修改后的协议，应当停止使用本系统。',
      '2、如乙方违反本协议规定，甲方有权不经通知随时对违规内容进行删除、屏蔽，并视情节对违规账号进行警告、删除部分或全部功能、账号封禁直至注销等处罚。',
      '2、如因不可抗力或其他法定事由导致本协议无法继续履行，双方可协商终止本协议。',
    ],
  },
  {
    label: '五、责任与赔偿',
    words: [
      '1、乙方因违反本协议或相关服务条款的规定，导致或产生第三方提出的任何索赔、要求或损失，乙方应独立承担责任。如甲方因此遭受损失，乙方也应一并赔偿。',
      '2、甲方不对因非人工方式采集数据、自动生成第三方网页链接等可能导致的意外、疏忽、侵权及其造成的损失承担责任。',
    ],
  },
  {
    label: '六、知识产权',
    words: ['本系统中所使用的公司LOGO等商业标识，其著作权或商标权归甲方所有。乙方在使用本系统时，应尊重甲方的知识产权，不得进行侵权行为。'],
  },
  {
    label: '七、法律适用与争议解决',
    words: [
      '1、本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。',
      '2、双方在履行本协议过程中发生争议，应首先通过友好协商解决；协商不成的，任何一方均可向甲方所在地人民法院提起诉讼。',
    ],
  },
]
</script>

<style scoped lang="less">
.protocol-wrap {
  width: 100%;
  padding: 40px 0px 20px;
}

.title {
  color: #000;
  text-align: center;
  font-weight: 600;
  font-size: 36px;
}
.tip {
  display: flex;
  flex-direction: column;
  font-size: 16px;
  margin: 30px 0px 10px;
}

.detail {
  margin-bottom: 14px;
  .label {
    font-size: 16px;
    font-weight: 600;
    line-height: 40px;
  }
  .text {
    font-size: 15px;
    line-height: 26px;
  }
}
</style>
