<template>
  <div class="secret-wrap">
    <div class="title">隐私政策</div>
    <div class="tip">
      <span>更新日期：【2024】年【10】月【8】日</span>
      <span>生效日期：【2024】年【10】月【8】日 </span>
    </div>
    <div class="detail" v-for="item of list" :key="item.label">
      <div class="label">{{ item.label }}</div>
      <div class="text" v-for="(el, index) of item.words" :key="index">{{ el }}</div>
    </div>
  </div>
</template>

<script setup lang="ts">
const list = [
  {
    label: '一、引言',
    words: [
      '本隐私政策旨在向用户阐述舆情研判平台（以下简称“本平台”）如何收集、使用、存储、共享及保护用户的个人信息。请您在使用本平台服务前，仔细阅读并理解本隐私政策，以确保您的个人信息得到妥善处理。',
    ],
  },
  {
    label: '二、个人信息收集',
    words: [
      '1、使用信息：当您使用本平台的功能时，我们可能会收集您的设备信息（如设备型号、操作系统版本等）、网络状态、使用时长及频率等，以优化服务质量和提升用户体验。',
      '2、敏感信息：在特定情况下，您可能需要提供邮箱地址、手机号码等敏感信息，以便我们及时向您发送预警通知。我们将严格保护您的敏感信息，并确保其仅用于指定目的',
    ],
  },
  {
    label: '三、个人信息使用',
    words: [
      '1、提供服务：我们将使用您提供的个人信息来为您提供舆情研判服务，包括数据分析、报告生成等。',
      '2、优化服务：通过收集您的使用信息，我们可以更好地了解您的需求，从而优化服务质量和提升用户体验。',
      '3、安全保障：我们将使用您的个人信息来保障账号安全，防止未经授权的访问和泄露。',
    ],
  },
  {
    label: '四、个人信息存储',
    words: [
      '1、存储地点：我们将在中华人民共和国境内存储您的个人信息，以确保其安全性和合规性。',
      '2、存储时间：我们将根据您的需求及法律法规要求，合理确定个人信息的存储期限。在存储期限内，我们将确保个人信息的准确性和完整性。',
    ],
  },
  {
    label: '五、个人信息共享',
    words: [
      '1、共享原则：我们仅在必要情况下，且与关联公司、合作伙伴或第三方服务提供商共享您的个人信息，以提供您所需的服务。',
      '2、共享内容：共享的个人信息将仅限于提供服务所必需的范围，且我们将与接收方签订严格的保密协议，确保个人信息安全。',
    ],
  },
  {
    label: '六、个人信息保护',
    words: [
      '1、安全措施：我们将采取各种安全措施，包括加密技术、防火墙等，以确保您的个人信息不被未经授权的访问、泄露或篡改。',
      '2、访问控制：我们将对访问个人信息的员工进行严格的权限管理，确保只有授权人员才能访问相关信息。',
    ],
  },
  {
    label: '七、用户权利',
    words: [
      '1、查询权：您有权查询我们收集的个人信息及其使用情况。',
      '2、更正权：如果您发现我们收集的个人信息有误，您有权要求我们更正。',
      '3、删除权：在特定情况下，如不再使用本平台服务时，您有权要求我们删除您的个人信息。',
    ],
  },
  {
    label: '八、政策更新',
    words: [
      '我们可能会根据法律法规要求或业务需要，对本隐私政策进行更新。更新后的隐私政策将在本平台上公布，并请您仔细阅读。如您继续使用本平台服务，则视为您同意更新后的隐私政策。',
    ],
  },
]
</script>

<style scoped lang="less">
.secret-wrap {
  width: 100%;
  padding: 40px 0px 20px;
}

.title {
  color: #000;
  text-align: center;
  font-weight: 600;
  font-size: 36px;
}
.tip {
  display: flex;
  flex-direction: column;
  font-size: 16px;
  margin: 30px 0px 10px;
}

.detail {
  margin-bottom: 14px;
  .label {
    font-size: 16px;
    font-weight: 600;
    line-height: 40px;
  }
  .text {
    font-size: 15px;
    line-height: 26px;
  }
}
</style>
